# UFCR-YOLOv13: Underwater Feature Calibration and Rebalance
# Base: original YOLOv13 with controlled P2 branch and P2->P3 scale rebalance.
nc: 4
stal_enabled: False
small_obj_px: 32.0
small_topk: 20
center_radius: 2.5
quality_gain: 0.0
nwd_gain: 0.0

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]    # 1-P2/4
  - [-1, 2, DSC3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]    # 3-P3/8
  - [-1, 2, DSC3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, DSConv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6-P4/16
  - [-1, 1, DSConv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]     # 8-P5/32

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 10
  - [9, 1, DownsampleConv, []]                                    # 11
  - [[6, 9], 1, FullPAD_Tunnel, []]                               # 12 P4 guide
  - [[4, 10], 1, FullPAD_Tunnel, []]                              # 13 P3 guide
  - [[8, 11], 1, FullPAD_Tunnel, []]                              # 14 P5 guide

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 15
  - [[-1, 12], 1, Concat, [1]]                                    # 16
  - [-1, 2, DSC3k2, [512, True]]                                  # 17
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 18 P4 top-down

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]                    # 19
  - [[-1, 13], 1, Concat, [1]]                                    # 20
  - [-1, 2, DSC3k2, [256, True]]                                  # 21
  - [10, 1, Conv, [256, 1, 1]]                                    # 22
  - [[21, 22], 1, FullPAD_Tunnel, []]                             # 23 P3 base

  # Underwater-aware controlled P2 branch
  - [2, 1, Conv, [128, 1, 1]]                                     # 24 P2 reduce
  - [24, 1, UWFeatCalib, [128]]                                   # 25 P2 calibrated
  - [23, 1, nn.Upsample, [None, 2, "nearest"]]                    # 26
  - [26, 1, Conv, [128, 1, 1]]                                    # 27 P3 up reduce
  - [27, 1, UWFeatCalib, [128]]                                   # 28 P3 up calibrated
  - [[28, 25], 1, CtrlP2Fuse, [128]]                              # 29 controlled P2 fusion
  - [-1, 2, DSC3k2, [128, True]]                                  # 30 P2 output

  # Local anti-aliased return and scale rebalance
  - [30, 1, AADown, [256]]                                        # 31 P2->P3
  - [[31, 23], 1, ScaleRebalance, [256]]                          # 32 P3 output

  - [32, 1, Conv, [256, 3, 2]]                                    # 33
  - [[-1, 18], 1, Concat, [1]]                                    # 34
  - [-1, 2, DSC3k2, [512, True]]                                  # 35
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 36 P4 output

  - [35, 1, Conv, [512, 3, 2]]                                    # 37
  - [[-1, 14], 1, Concat, [1]]                                    # 38
  - [-1, 2, DSC3k2, [1024, True]]                                 # 39
  - [[-1, 11], 1, FullPAD_Tunnel, []]                             # 40 P5 output

  - [[30, 32, 36, 40], 1, Detect, [nc]]                           # P2/P3/P4/P5
