# UFCR-Next ablation: full model without EdgeConfidenceP2Fuse.
nc: 4
stal_enabled: False
small_obj_px: 32.0
small_topk: 20
center_radius: 2.5
quality_gain: 0.0
nwd_gain: 0.0

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]
  - [-1, 2, DSC3k2, [512, False, 0.25]]
  - [-1, 1, DSConv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [9, 1, DownsampleConv, []]
  - [[6, 9], 1, FullPAD_Tunnel, []]
  - [[4, 10], 1, FullPAD_Tunnel, []]
  - [[8, 11], 1, FullPAD_Tunnel, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [10, 1, Conv, [256, 1, 1]]
  - [[21, 22], 1, FullPAD_Tunnel, []]                             # 23 P3 base

  - [2, 1, Conv, [128, 1, 1]]                                     # 24 P2 reduce
  - [24, 1, WTFeatCalib, [128]]                                   # 25
  - [23, 1, AARUp, [256, 2]]                                      # 26
  - [26, 1, Conv, [128, 1, 1]]                                    # 27 P3 up reduce
  - [27, 1, WTFeatCalib, [128]]                                   # 28
  - [[28, 25], 1, CtrlP2Fuse, [128]]                              # 29 ablate EdgeConfidenceP2Fuse
  - [-1, 2, DSC3k2, [128, True]]                                  # 30 P2 output

  - [30, 1, AARDown, [256]]                                       # 31
  - [[31, 23], 1, ScaleRebalance, [256]]                          # 32 P3 output

  - [32, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 36 P4 output

  - [35, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 11], 1, FullPAD_Tunnel, []]                             # 40 P5 output

  - [[30, 32, 36, 40], 1, Detect, [nc]]
