ucra_aux: 0.03
nc: 4

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, UDCStem, [64, 3, 2]]
  - [-1, 1, Conv,   [128, 3, 2, 1, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv,   [256, 3, 2, 1, 4]]
  - [-1, 2, DSC3k2, [512, False, 0.25]]
  - [-1, 1, DSConv, [512, 3, 2]]
  - [-1, 4, A2C2f,  [512, True, 4]]
  - [-1, 1, DSConv, [1024, 3, 2]]
  - [-1, 4, A2C2f,  [1024, True, 1]]

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [9, 1, DownsampleConv, []]
  - [[6, 9], 1, FullPAD_Tunnel, []]
  - [[4, 10], 1, FullPAD_Tunnel, []]
  - [[8, 11], 1, FullPAD_Tunnel, []]

  - [[14, 12], 1, UCRA_SemUp, [512, 4, 3]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [[16, 13], 1, UCRA_DetailUp, [256, 4, 3]]
  - [-1, 2, DSC3k2, [256, True]]
  - [10, 1, Conv, [256, 1, 1]]
  - [[19, 20], 1, FullPAD_Tunnel, []]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [24, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 11], 1, FullPAD_Tunnel, []]

  - [[21, 25, 29], 1, Detect, [nc]]
