# UFCR-A4: A3 + existing QDetect quality branch and S-TAL assignment.
nc: 4
stal_enabled: True
small_obj_px: 32.0
small_topk: 20
center_radius: 2.5
quality_gain: 0.10
nwd_gain: 0.0

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]
  - [-1, 2, DSC3k2, [512, False, 0.25]]
  - [-1, 1, DSConv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 10
  - [9, 1, DownsampleConv, []]                                    # 11
  - [[6, 9], 1, FullPAD_Tunnel, []]                               # 12 P4 guide
  - [[4, 10], 1, FullPAD_Tunnel, []]                              # 13 P3 guide
  - [[8, 11], 1, FullPAD_Tunnel, []]                              # 14 P5 guide

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 15
  - [[-1, 12], 1, Concat, [1]]                                    # 16
  - [-1, 2, DSC3k2, [512, True]]                                  # 17
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 18 P4 top-down

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]                    # 19
  - [[-1, 13], 1, Concat, [1]]                                    # 20
  - [-1, 2, DSC3k2, [256, True]]                                  # 21
  - [10, 1, Conv, [256, 1, 1]]                                    # 22
  - [[21, 22], 1, FullPAD_Tunnel, []]                             # 23 P3 base
  - [23, 1, UWFeatCalib, [256]]                                   # 24 P3 calibrated

  - [2, 1, Conv, [128, 1, 1]]                                     # 25 P2 reduce
  - [25, 1, UWFeatCalib, [128]]                                   # 26 P2 calibrated
  - [24, 1, nn.Upsample, [None, 2, "nearest"]]                    # 27
  - [27, 1, Conv, [128, 1, 1]]                                    # 28 P3 up reduce
  - [28, 1, UWFeatCalib, [128]]                                   # 29 P3 up calibrated
  - [[29, 26], 1, CtrlP2Fuse, [128]]                              # 30 controlled P2 fusion
  - [-1, 2, DSC3k2, [128, True]]                                  # 31 P2 output

  - [31, 1, AADown, [256]]                                        # 32 P2->P3
  - [[32, 24], 1, ScaleRebalance, [256]]                          # 33 P3 output

  - [33, 1, Conv, [256, 3, 2]]                                    # 34
  - [[-1, 18], 1, Concat, [1]]                                    # 35
  - [-1, 2, DSC3k2, [512, True]]                                  # 36
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 37 P4 output

  - [36, 1, Conv, [512, 3, 2]]                                    # 38
  - [[-1, 14], 1, Concat, [1]]                                    # 39
  - [-1, 2, DSC3k2, [1024, True]]                                 # 40
  - [[-1, 11], 1, FullPAD_Tunnel, []]                             # 41 P5 output

  - [[31, 33, 37, 41], 1, QDetect, [nc]]                          # P2/P3/P4/P5
